app/controllers/projects_controller.rb

  def create
    @project = current_user.projects.build(project_params)

    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("name", "description", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["name", "test1 "], ["description", "test"], ["user_id", 2], ["created_at", "2022-10-11 07:29:12.118144"], ["updated_at", "2022-10-11 07:29:12.118144"]]

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "testing"], ["updated_at", "2022-10-13 00:15:01.769517"], ["id", 3]]

    def set_project
      @project = current_user.projects.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."user_id" = ? AND "projects"."id" = ? LIMIT ?  [["user_id", 2], ["id", 1], ["LIMIT", 1]]